neelanandini/Learing_purpose/Project_Settings/Startup_Code/startup_MPC5775B.S
    e_lis       r2, _SDA2_BASE_@h       ;# Initialize r2 to sdata2 base
    e_or2i      r2, _SDA2_BASE_@l       ;# (provided by linker).

    e_stwu      r0, -64(r1)             ;# Terminate stack.

#ifndef __NO_SYSTEM_INIT
;# Call the system init routine
    e_bl   SystemInit
#endif
;# Init .data and .bss sections
    e_bl   init_data_bss
    wrteei 1    ;# Enable interrupts
;# Call custom init function
;# This symbol must be defined in the ASM preprocessor e.g -DCUSTOM_INIT=my_func, 
;# where my_func is a void function that does not take any parameters and it is defined in the application code
#ifdef CUSTOM_INIT
    e_bl CUSTOM_INIT
#endif

;# Jump to Main
    e_bl        main

    .section .intc_vector_table, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long  SS0_IRQHandler                                  /**< Software setable flag 0 SSCIR0[CLR0] */
    .long  SS1_IRQHandler                                  /**< Software setable flag 1 SSCIR0[CLR1] */
    .long  SS2_IRQHandler                                  /**< Software setable flag 2 SSCIR0[CLR2] */
    .long  SS3_IRQHandler                                  /**< Software setable flag 3 SSCIR0[CLR3] */
    .long  SS4_IRQHandler                                  /**< Software setable flag 4 SSCIR0[CLR4] */
    .long  SS5_IRQHandler                                  /**< Software setable flag 5 SSCIR0[CLR5] */
    .long  SS6_IRQHandler                                  /**< Software setable flag 6 SSCIR0[CLR6] */
    .long  SS7_IRQHandler                                  /**< Software setable flag 7 SSCIR0[CLR7] */
    .long  SWT0_IRQHandler                                 /**< Software Watchdog 0 Interrupt flag */
    .long  FCCU_MISC_IRQHandler                            /**< FCCU ALARM state entry | FCCU CONFIG state watchdog timeout */
    .long  DMA0_Ch0_Ch31_Error_IRQHandler                  /**< eDMA0 channel Error flags 0-31 */
    .long  DMA0_Ch0_IRQHandler                             /**< eDMA0 channel Interrupt 0 */
    .long  DMA0_Ch1_IRQHandler                             /**< eDMA0 channel Interrupt 1 */
    .long  DMA0_Ch2_IRQHandler                             /**< eDMA0 channel Interrupt 2 */
    .long  DMA0_Ch3_IRQHandler                             /**< eDMA0 channel Interrupt 3 */
    .long  DMA0_Ch4_IRQHandler                             /**< eDMA0 channel Interrupt 4 */
    .long  DMA0_Ch5_IRQHandler                             /**< eDMA0 channel Interrupt 5 */
    .long  DMA0_Ch6_IRQHandler                             /**< eDMA0 channel Interrupt 6 */
    .long  DMA0_Ch7_IRQHandler                             /**< eDMA0 channel Interrupt 7 */
    .long  DMA0_Ch8_IRQHandler                             /**< eDMA0 channel Interrupt 8 */
    .long  DMA0_Ch9_IRQHandler                             /**< eDMA0 channel Interrupt 9 */
    .long  DMA0_Ch10_IRQHandler                            /**< eDMA0 channel Interrupt 10 */
    .long  DMA0_Ch11_IRQHandler                            /**< eDMA0 channel Interrupt 11 */
    .long  DMA0_Ch12_IRQHandler                            /**< eDMA0 channel Interrupt 12 */
    .long  DMA0_Ch13_IRQHandler                            /**< eDMA0 channel Interrupt 13 */
    .long  DMA0_Ch14_IRQHandler                            /**< eDMA0 channel Interrupt 14 */
    .long  DMA0_Ch15_IRQHandler                            /**< eDMA0 channel Interrupt 15 */
    .long  DMA0_Ch16_IRQHandler                            /**< eDMA0 channel Interrupt 16 */
    .long  DMA0_Ch17_IRQHandler                            /**< eDMA0 channel Interrupt 17 */
    .long  DMA0_Ch18_IRQHandler                            /**< eDMA0 channel Interrupt 18 */
    .long  DMA0_Ch19_IRQHandler                            /**< eDMA0 channel Interrupt 19 */
    .long  DMA0_Ch20_IRQHandler                            /**< eDMA0 channel Interrupt 20 */
    .long  DMA0_Ch21_IRQHandler                            /**< eDMA0 channel Interrupt 21 */
    .long  DMA0_Ch22_IRQHandler                            /**< eDMA0 channel Interrupt 22 */
    .long  DMA0_Ch23_IRQHandler                            /**< eDMA0 channel Interrupt 23 */
    .long  DMA0_Ch24_IRQHandler                            /**< eDMA0 channel Interrupt 24 */
    .long  DMA0_Ch25_IRQHandler                            /**< eDMA0 channel Interrupt 25 */
    .long  DMA0_Ch26_IRQHandler                            /**< eDMA0 channel Interrupt 26 */
    .long  DMA0_Ch27_IRQHandler                            /**< eDMA0 channel Interrupt 27 */
    .long  DMA0_Ch28_IRQHandler                            /**< eDMA0 channel Interrupt 28 */
    .long  DMA0_Ch29_IRQHandler                            /**< eDMA0 channel Interrupt 29 */
    .long  DMA0_Ch30_IRQHandler                            /**< eDMA0 channel Interrupt 30 */
    .long  DMA0_Ch31_IRQHandler                            /**< eDMA0 channel Interrupt 31 */
    .long  PCS_IRQHandler                                  /**< Progressive Clock Switch Interrupt SIU_PCSIFR[PCSI] */
    .long  PLL_IRQHandler                                  /**< PLL Loss of Lock Flags PLL0_SR[LOLF] | PLL1_SR[LOLF] */
    .long  SIU_OVF_IRQHandler                              /**< SIU combined overrun interrupt requests of the external interrupt Overrun Flags */
    .long  SIU_0_IRQHandler                                /**< SIU External Interrupt Flag 0 SIU_EIISR[EIF0] */
    .long  SIU_1_IRQHandler                                /**< SIU External Interrupt Flag 1 SIU_EIISR[EIF1] */
    .long  SIU_2_IRQHandler                                /**< SIU External Interrupt Flag 2 SIU_EIISR[EIF2] */
    .long  SIU_3_IRQHandler                                /**< SIU External Interrupt Flag 3 SIU_EIISR[EIF3] */
    .long  SIU_4_15_IRQHandler                             /**< SIU External Interrupt Flag 15-4 SIU_EIISR[EIF15:EIF4] */
    .long  EMIOS0_F0_IRQHandler                            /**< eMIOS_0 channel 0 Flag */
    .long  EMIOS0_F1_IRQHandler                            /**< eMIOS_0 channel 1 Flag */
    .long  EMIOS0_F2_IRQHandler                            /**< eMIOS_0 channel 2 Flag */
    .long  EMIOS0_F3_IRQHandler                            /**< eMIOS_0 channel 3 Flag */
    .long  EMIOS0_F4_IRQHandler                            /**< eMIOS_0 channel 4 Flag */
    .long  EMIOS0_F5_IRQHandler                            /**< eMIOS_0 channel 5 Flag */
    .long  EMIOS0_F6_IRQHandler                            /**< eMIOS_0 channel 6 Flag */
    .long  EMIOS0_F7_IRQHandler                            /**< eMIOS_0 channel 7 Flag */
    .long  EMIOS1_F0_IRQHandler                            /**< eMIOS_1 channel 0 Flag */
    .long  EMIOS1_F1_IRQHandler                            /**< eMIOS_1 channel 1 Flag */
    .long  EMIOS1_F2_IRQHandler                            /**< eMIOS_1 channel 2 Flag */
    .long  EMIOS1_F3_IRQHandler                            /**< eMIOS_1 channel 3 Flag */
    .long  EMIOS1_F4_IRQHandler                            /**< eMIOS_1 channel 4 Flag */
    .long  EMIOS1_F5_IRQHandler                            /**< eMIOS_1 channel 5 Flag */
    .long  EMIOS1_F6_IRQHandler                            /**< eMIOS_1 channel 6 Flag */
    .long  EMIOS1_F7_IRQHandler                            /**< eMIOS_1 channel 7 Flag */
    .long  ETPU01_GE_IRQHandler                            /**< eTPU Engine 0 and 1 Global Exception */
    .long  ETPU0_CIS0_IRQHandler                           /**< eTPU Engine 0 Channel 0 Interrupt Status */
    .long  ETPU0_CIS1_IRQHandler                           /**< eTPU Engine 0 Channel 1 Interrupt Status */
    .long  ETPU0_CIS2_IRQHandler                           /**< eTPU Engine 0 Channel 2 Interrupt Status */
    .long  ETPU0_CIS3_IRQHandler                           /**< eTPU Engine 0 Channel 3 Interrupt Status */
    .long  ETPU0_CIS4_IRQHandler                           /**< eTPU Engine 0 Channel 4 Interrupt Status */
    .long  ETPU0_CIS5_IRQHandler                           /**< eTPU Engine 0 Channel 5 Interrupt Status */
    .long  ETPU0_CIS6_IRQHandler                           /**< eTPU Engine 0 Channel 6 Interrupt Status */
    .long  ETPU0_CIS7_IRQHandler                           /**< eTPU Engine 0 Channel 7 Interrupt Status */
    .long  ETPU0_CIS8_IRQHandler                           /**< eTPU Engine 0 Channel 8 Interrupt Status */
    .long  ETPU0_CIS9_IRQHandler                           /**< eTPU Engine 0 Channel 9 Interrupt Status */
    .long  ETPU0_CIS10_IRQHandler                          /**< eTPU Engine 0 Channel 10 Interrupt Status */
    .long  ETPU0_CIS11_IRQHandler                          /**< eTPU Engine 0 Channel 11 Interrupt Status */
    .long  ETPU0_CIS12_IRQHandler                          /**< eTPU Engine 0 Channel 12 Interrupt Status */
    .long  ETPU0_CIS13_IRQHandler                          /**< eTPU Engine 0 Channel 13 Interrupt Status */
    .long  ETPU0_CIS14_IRQHandler                          /**< eTPU Engine 0 Channel 14 Interrupt Status */
    .long  ETPU0_CIS15_IRQHandler                          /**< eTPU Engine 0 Channel 15 Interrupt Status */
    .long  ETPU0_CIS16_IRQHandler                          /**< eTPU Engine 0 Channel 16 Interrupt Status */
    .long  ETPU0_CIS17_IRQHandler                          /**< eTPU Engine 0 Channel 17 Interrupt Status */
    .long  ETPU0_CIS18_IRQHandler                          /**< eTPU Engine 0 Channel 18 Interrupt Status */
    .long  ETPU0_CIS19_IRQHandler                          /**< eTPU Engine 0 Channel 19 Interrupt Status */
    .long  ETPU0_CIS20_IRQHandler                          /**< eTPU Engine 0 Channel 20 Interrupt Status */
    .long  ETPU0_CIS21_IRQHandler                          /**< eTPU Engine 0 Channel 21 Interrupt Status */
    .long  ETPU0_CIS22_IRQHandler                          /**< eTPU Engine 0 Channel 22 Interrupt Status */
    .long  ETPU0_CIS23_IRQHandler                          /**< eTPU Engine 0 Channel 23 Interrupt Status */
    .long  ETPU0_CIS24_IRQHandler                          /**< eTPU Engine 0 Channel 24 Interrupt Status */
    .long  ETPU0_CIS25_IRQHandler                          /**< eTPU Engine 0 Channel 25 Interrupt Status */
    .long  ETPU0_CIS26_IRQHandler                          /**< eTPU Engine 0 Channel 26 Interrupt Status */
    .long  ETPU0_CIS27_IRQHandler                          /**< eTPU Engine 0 Channel 27 Interrupt Status */
    .long  ETPU0_CIS28_IRQHandler                          /**< eTPU Engine 0 Channel 28 Interrupt Status */
    .long  ETPU0_CIS29_IRQHandler                          /**< eTPU Engine 0 Channel 29 Interrupt Status */
    .long  ETPU0_CIS30_IRQHandler                          /**< eTPU Engine 0 Channel 30 Interrupt Status */
    .long  ETPU0_CIS31_IRQHandler                          /**< eTPU Engine 0 Channel 31 Interrupt Status */
    .long  EQADC0_OVRx_IRQHandler                          /**< eQADC combined overrun interrupt requests from all of the FIFOs: Trigger Overrun, Receive FIFO Overflow and command FIFO Underflow */
    .long  EQADC0_FIFO0_NCF_IRQHandler                     /**< eQADC command FIFO 0 Non-Coherency Flag */
    .long  EQADC0_FIFO0_PF_IRQHandler                      /**< eQADC command FIFO 0 Pause Flag */
    .long  EQADC0_FIFO0_EOQF_IRQHandler                    /**< eQADC command FIFO 0 command queue End of Queue Flag */
    .long  EQADC0_FIFO0_CFFF_IRQHandler                    /**< eQADC Command FIFO 0 Fill Flag */
    .long  EQADC0_FIFO0_RFDF_IRQHandler                    /**< eQADC Receive FIFO 0 Drain Flag */
    .long  EQADC0_FIFO1_NCF_IRQHandler                     /**< eQADC command FIFO 1 Non-Coherency Flag */
    .long  EQADC0_FIFO1_PF_IRQHandler                      /**< eQADC command FIFO 1 Pause Flag */
    .long  EQADC0_FIFO1_EOQF_IRQHandler                    /**< eQADC command FIFO 1 command queue End of Queue Flag */
    .long  EQADC0_FIFO1_CFFF_IRQHandler                    /**< eQADC Command FIFO 1 Fill Flag */
    .long  EQADC0_FIFO1_RFDF_IRQHandler                    /**< eQADC Receive FIFO 1 Drain Flag */
    .long  EQADC0_FIFO2_NCF_IRQHandler                     /**< eQADC command FIFO 2 Non-Coherency Flag */
    .long  EQADC0_FIFO2_PF_IRQHandler                      /**< eQADC command FIFO 2 Pause Flag */
    .long  EQADC0_FIFO2_EOQF_IRQHandler                    /**< eQADC command FIFO 2 command queue End of Queue Flag */
    .long  EQADC0_FIFO2_CFFF_IRQHandler                    /**< eQADC Command FIFO 2 Fill Flag */
    .long  EQADC0_FIFO2_RFDF_IRQHandler                    /**< eQADC Receive FIFO 2 Drain Flag */
    .long  EQADC0_FIFO3_NCF_IRQHandler                     /**< eQADC command FIFO 3 Non-Coherency Flag */
    .long  EQADC0_FIFO3_PF_IRQHandler                      /**< eQADC command FIFO 3 Pause Flag */
    .long  EQADC0_FIFO3_EOQF_IRQHandler                    /**< eQADC command FIFO 3 command queue End of Queue Flag */
    .long  EQADC0_FIFO3_CFFF_IRQHandler                    /**< eQADC Command FIFO 3 Fill Flag */
    .long  EQADC0_FIFO3_RFDF_IRQHandler                    /**< eQADC Receive FIFO 3 Drain Flag */
    .long  EQADC0_FIFO4_NCF_IRQHandler                     /**< eQADC command FIFO 4 Non-Coherency Flag */
    .long  EQADC0_FIFO4_PF_IRQHandler                      /**< eQADC command FIFO 4 Pause Flag */
    .long  EQADC0_FIFO4_EOQF_IRQHandler                    /**< eQADC command FIFO 4 command queue End of Queue Flag */
    .long  EQADC0_FIFO4_CFFF_IRQHandler                    /**< eQADC Command FIFO 4 Fill Flag */
    .long  EQADC0_FIFO4_RFDF_IRQHandler                    /**< eQADC Receive FIFO 4 Drain Flag */
    .long  EQADC0_FIFO5_NCF_IRQHandler                     /**< eQADC command FIFO 5 Non-Coherency Flag */
    .long  EQADC0_FIFO5_PF_IRQHandler                      /**< eQADC command FIFO 5 Pause Flag */
    .long  EQADC0_FIFO5_EOQF_IRQHandler                    /**< eQADC command FIFO 5 command queue End of Queue Flag */
    .long  EQADC0_FIFO5_CFFF_IRQHandler                    /**< eQADC Command FIFO 5 Fill Flag */
    .long  EQADC0_FIFO5_RFDF_IRQHandler                    /**< eQADC Receive FIFO 5 Drain Flag */
    .long  DSPI1_FIFO_Error_IRQHandler                     /**< DSPI_1 combined overrun and parity error interrupt requests: Transmit FIFO Underflow/Receive FIFO Overflow SPI Parity Error/DSI Parity Error */
    .long  DSPI1_TXFIFO_EOQF_IRQHandler                    /**< DSPI_1 transmit FIFO End of Queue Flag */
    .long  DSPI1_Send_IRQHandler                           /**< DSPI_1 Transmit FIFO Fill Flag */
    .long  DSPI1_TCF_IRQHandler                            /**< DSPI_1 Transfer Complete/DSI Data Match Flag */
    .long  DSPI1_Receive_IRQHandler                        /**< DSPI_1 Receive FIFO Drain Flag */
    .long  DSPI2_FIFO_Error_IRQHandler                     /**< DSPI_2 combined overrun and parity error interrupt requests: Transmit FIFO Underflow/Receive FIFO Overflow SPI Parity Error/DSI Parity Error */
    .long  DSPI2_TXFIFO_EOQF_IRQHandler                    /**< DSPI_2 transmit FIFO End of Queue Flag */
    .long  DSPI2_Send_IRQHandler                           /**< DSPI_2 Transmit FIFO Fill Flag */
    .long  DSPI2_TCF_IRQHandler                            /**< DSPI_2 Transfer Complete/DSI Data Match Flag */
    .long  DSPI2_Receive_IRQHandler                        /**< DSPI_2 Receive FIFO Drain Flag */
    .long  DSPI3_FIFO_Error_IRQHandler                     /**< DSPI_3 combined overrun and parity error interrupt requests: Transmit FIFO Underflow/Receive FIFO Overflow SPI Parity Error/DSI Parity Error */
    .long  DSPI3_TXFIFO_EOQF_IRQHandler                    /**< DSPI_3 transmit FIFO End of Queue Flag */
    .long  DSPI3_Send_IRQHandler                           /**< DSPI_3 Transmit FIFO Fill Flag */
    .long  DSPI3_TCF_IRQHandler                            /**< DSPI_3 Transfer Complete/DSI Data Match Flag */
    .long  DSPI3_Receive_IRQHandler                        /**< DSPI_3 Receive FIFO Drain Flag */
    .long  ESCI0_CIR_IRQHandler                            /**< Combined Interrupt Requests of ESCI Module 0 */
    .long  PCU_MASTER0_IRQHandler                          /**< PCU_IR0[OIF] | PCU_IR0[EIF] */
    .long  PCU_MASTER1_IRQHandler                          /**< PCU_IR1[OIF] | PCU_IR1[EIF] */
    .long  ESCI1_CIR_IRQHandler                            /**< Combined Interrupt Requests of ESCI Module 1 */
    .long  PSI50_SDOE_IRQHandler                           /**< PSI5_0 DMA Status, New data, OverWrite, Error interrupts */
    .long  PSI51_SDOE_IRQHandler                           /**< PSI5_1 DMA Status, New data, OverWrite, Error interrupts */
    .long  CAN0_ESR1_IRQHandler                            /**< FlexCAN_0 Bus Off, Transmit Warning, Receive Warning */
    .long  CAN0_ESR2_IRQHandler                            /**< FlexCAN_0 Error, FlexCAN_0 ECC Correctable Error, FlexCAN_0 ECC Host Access Non-Correctable Error, FlexCAN_0 ECC CAN Access Non-Correctable Error */
    .long  DefaultISR                         
    .long  CAN0_BUF0_IRQHandler                            /**< FlexCAN_0 Buffer 0 Interrupt */
    .long  CAN0_BUF1_IRQHandler                            /**< FlexCAN_0 Buffer 1 Interrupt */
    .long  CAN0_BUF2_IRQHandler                            /**< FlexCAN_0 Buffer 2 Interrupt */
    .long  CAN0_BUF3_IRQHandler                            /**< FlexCAN_0 Buffer 3 Interrupt */
    .long  CAN0_BUF4_IRQHandler                            /**< FlexCAN_0 Buffer 4 Interrupt */
    .long  CAN0_BUF5_IRQHandler                            /**< FlexCAN_0 Buffer 5 Interrupt */
    .long  CAN0_BUF6_IRQHandler                            /**< FlexCAN_0 Buffer 6 Interrupt */
    .long  CAN0_BUF7_IRQHandler                            /**< FlexCAN_0 Buffer 7 Interrupt */
    .long  CAN0_BUF8_IRQHandler                            /**< FlexCAN_0 Buffer 8 Interrupt */
    .long  CAN0_BUF9_IRQHandler                            /**< FlexCAN_0 Buffer 9 Interrupt */
    .long  CAN0_BUF10_IRQHandler                           /**< FlexCAN_0 Buffer 10 Interrupt */
    .long  CAN0_BUF11_IRQHandler                           /**< FlexCAN_0 Buffer 11 Interrupt */
    .long  CAN0_BUF12_IRQHandler                           /**< FlexCAN_0 Buffer 12 Interrupt */
    .long  CAN0_BUF13_IRQHandler                           /**< FlexCAN_0 Buffer 13 Interrupt */
    .long  CAN0_BUF14_IRQHandler                           /**< FlexCAN_0 Buffer 14 Interrupt */
    .long  CAN0_BUF15_IRQHandler                           /**< FlexCAN_0 Buffer 15 Interrupt */
    .long  CAN0_BUF16_31_IRQHandler                        /**< FlexCAN_0 Buffers 31-16 Interrupts */
    .long  CAN0_BUF32_63_IRQHandler                        /**< FlexCAN_0 Buffers 63-32 Interrupts */
    .long  CAN2_ESR1_IRQHandler                            /**< FlexCAN_2 Bus Off, Transmit Warning, Receive Warning */
    .long  CAN2_ESR2_IRQHandler                            /**< FlexCAN_2 Error, FlexCAN_2 ECC Correctable Error, FlexCAN_2 ECC Host Access Non-Correctable Error, FlexCAN_2 ECC CAN Access Non-Correctable Error */
    .long  DefaultISR                         
    .long  CAN2_BUF0_IRQHandler                            /**< FlexCAN_2 Buffer 0 Interrupt */
    .long  CAN2_BUF1_IRQHandler                            /**< FlexCAN_2 Buffer 1 Interrupt */
    .long  CAN2_BUF2_IRQHandler                            /**< FlexCAN_2 Buffer 2 Interrupt */
    .long  CAN2_BUF3_IRQHandler                            /**< FlexCAN_2 Buffer 3 Interrupt */
    .long  CAN2_BUF4_IRQHandler                            /**< FlexCAN_2 Buffer 4 Interrupt */
    .long  CAN2_BUF5_IRQHandler                            /**< FlexCAN_2 Buffer 5 Interrupt */
    .long  CAN2_BUF6_IRQHandler                            /**< FlexCAN_2 Buffer 6 Interrupt */
    .long  CAN2_BUF7_IRQHandler                            /**< FlexCAN_2 Buffer 7 Interrupt */
    .long  CAN2_BUF8_IRQHandler                            /**< FlexCAN_2 Buffer 8 Interrupt */
    .long  CAN2_BUF9_IRQHandler                            /**< FlexCAN_2 Buffer 9 Interrupt */
    .long  CAN2_BUF10_IRQHandler                           /**< FlexCAN_2 Buffer 10 Interrupt */
    .long  CAN2_BUF11_IRQHandler                           /**< FlexCAN_2 Buffer 11 Interrupt */
    .long  CAN2_BUF12_IRQHandler                           /**< FlexCAN_2 Buffer 12 Interrupt */
    .long  CAN2_BUF13_IRQHandler                           /**< FlexCAN_2 Buffer 13 Interrupt */
    .long  CAN2_BUF14_IRQHandler                           /**< FlexCAN_2 Buffer 14 Interrupt */
    .long  CAN2_BUF15_IRQHandler                           /**< FlexCAN_2 Buffer 15 Interrupt */
    .long  CAN2_BUF16_31_IRQHandler                        /**< FlexCAN_2 Buffers 31-16 Interrupts */
    .long  CAN2_BUF32_63_IRQHandler                        /**< FlexCAN_2 Buffers 63-32 Interrupts */
    .long  FEC_TXF_IRQHandler                              /**< FEC Transmit Frame flag */
    .long  FEC_RXF_IRQHandler                              /**< FEC Receive Frame flag */
    .long  FEC_ERR_IRQHandler                              /**< Combined Interrupt Requests of the FEC Ethernet Interrupt Event Register */
    .long  DEC0_IDF_IRQHandler                             /**< Decimation 0 Input (Fill) */
    .long  DEC0_OD_SD_IRQHandler                           /**< Decimation 0 Output/Integ (Drain/Integ) */
    .long  DEC0_ERR_IRQHandler                             /**< Decimation 0 Error */
    .long  STM_CIR0_IRQHandler                             /**< System Timer Module Interrupt 0 */
    .long  STM_CIR123_IRQHandler                           /**< System Timer Module Interrupts 1, 2, 3 */
    .long  EMIOS0_CH16_IRQHandler                          /**< eMIOS_0 channel 16 Flag */
    .long  EMIOS0_CH17_IRQHandler                          /**< eMIOS_0 channel 17 Flag */
    .long  EMIOS0_CH18_IRQHandler                          /**< eMIOS_0 channel 18 Flag */
    .long  EMIOS0_CH19_IRQHandler                          /**< eMIOS_0 channel 19 Flag */
    .long  EMIOS0_CH20_IRQHandler                          /**< eMIOS_0 channel 20 Flag */
    .long  EMIOS0_CH21_IRQHandler                          /**< eMIOS_0 channel 21 Flag */
    .long  EMIOS0_CH22_IRQHandler                          /**< eMIOS_0 channel 22 Flag */
    .long  EMIOS0_CH23_IRQHandler                          /**< eMIOS_0 channel 23 Flag */
    .long  DMA0_Ch32_Ch63_Error_IRQHandler                 /**< eDMA0 channel Error flags 32-63 */
    .long  DMA0_Ch32_IRQHandler                            /**< eDMA0 channel Interrupt 32 */
    .long  DMA0_Ch33_IRQHandler                            /**< eDMA0 channel Interrupt 33 */
    .long  DMA0_Ch34_IRQHandler                            /**< eDMA0 channel Interrupt 34 */
    .long  DMA0_Ch35_IRQHandler                            /**< eDMA0 channel Interrupt 35 */
    .long  DMA0_Ch36_IRQHandler                            /**< eDMA0 channel Interrupt 36 */
    .long  DMA0_Ch37_IRQHandler                            /**< eDMA0 channel Interrupt 37 */
    .long  DMA0_Ch38_IRQHandler                            /**< eDMA0 channel Interrupt 38 */
    .long  DMA0_Ch39_IRQHandler                            /**< eDMA0 channel Interrupt 39 */
    .long  DMA0_Ch40_IRQHandler                            /**< eDMA0 channel Interrupt 40 */
    .long  DMA0_Ch41_IRQHandler                            /**< eDMA0 channel Interrupt 41 */
    .long  DMA0_Ch42_IRQHandler                            /**< eDMA0 channel Interrupt 42 */
    .long  DMA0_Ch43_IRQHandler                            /**< eDMA0 channel Interrupt 43 */
    .long  DMA0_Ch44_IRQHandler                            /**< eDMA0 channel Interrupt 44 */
    .long  DMA0_Ch45_IRQHandler                            /**< eDMA0 channel Interrupt 45 */
