neelanandini/Learing_purpose/Project_Settings/Startup_Code/startup_MPC5775B.S
    .long  DMA0_Ch46_IRQHandler                            /**< eDMA0 channel Interrupt 46 */
    .long  DMA0_Ch47_IRQHandler                            /**< eDMA0 channel Interrupt 47 */
    .long  DMA0_Ch48_IRQHandler                            /**< eDMA0 channel Interrupt 48 */
    .long  DMA0_Ch49_IRQHandler                            /**< eDMA0 channel Interrupt 49 */
    .long  DMA0_Ch50_IRQHandler                            /**< eDMA0 channel Interrupt 50 */
    .long  DMA0_Ch51_IRQHandler                            /**< eDMA0 channel Interrupt 51 */
    .long  DMA0_Ch52_IRQHandler                            /**< eDMA0 channel Interrupt 52 */
    .long  DMA0_Ch53_IRQHandler                            /**< eDMA0 channel Interrupt 53 */
    .long  DMA0_Ch54_IRQHandler                            /**< eDMA0 channel Interrupt 54 */
    .long  DMA0_Ch55_IRQHandler                            /**< eDMA0 channel Interrupt 55 */
    .long  DMA0_Ch56_IRQHandler                            /**< eDMA0 channel Interrupt 56 */
    .long  DMA0_Ch57_IRQHandler                            /**< eDMA0 channel Interrupt 57 */
    .long  DMA0_Ch58_IRQHandler                            /**< eDMA0 channel Interrupt 58 */
    .long  DMA0_Ch59_IRQHandler                            /**< eDMA0 channel Interrupt 59 */
    .long  DMA0_Ch60_IRQHandler                            /**< eDMA0 channel Interrupt 60 */
    .long  DMA0_Ch61_IRQHandler                            /**< eDMA0 channel Interrupt 61 */
    .long  DMA0_Ch62_IRQHandler                            /**< eDMA0 channel Interrupt 62 */
    .long  DMA0_Ch63_IRQHandler                            /**< eDMA0 channel Interrupt 63 */
    .long  ETPU1_CIS0_IRQHandler                           /**< eTPU Engine 1 Channel 0 Interrupt Status */
    .long  ETPU1_CIS1_IRQHandler                           /**< eTPU Engine 1 Channel 1 Interrupt Status */
    .long  ETPU1_CIS2_IRQHandler                           /**< eTPU Engine 1 Channel 2 Interrupt Status */
    .long  ETPU1_CIS3_IRQHandler                           /**< eTPU Engine 1 Channel 3 Interrupt Status */
    .long  ETPU1_CIS4_IRQHandler                           /**< eTPU Engine 1 Channel 4 Interrupt Status */
    .long  ETPU1_CIS5_IRQHandler                           /**< eTPU Engine 1 Channel 5 Interrupt Status */
    .long  ETPU1_CIS6_IRQHandler                           /**< eTPU Engine 1 Channel 6 Interrupt Status */
    .long  ETPU1_CIS7_IRQHandler                           /**< eTPU Engine 1 Channel 7 Interrupt Status */
    .long  ETPU1_CIS8_IRQHandler                           /**< eTPU Engine 1 Channel 8 Interrupt Status */
    .long  ETPU1_CIS9_IRQHandler                           /**< eTPU Engine 1 Channel 9 Interrupt Status */
    .long  ETPU1_CIS10_IRQHandler                          /**< eTPU Engine 1 Channel 10 Interrupt Status */
    .long  ETPU1_CIS11_IRQHandler                          /**< eTPU Engine 1 Channel 11 Interrupt Status */
    .long  ETPU1_CIS12_IRQHandler                          /**< eTPU Engine 1 Channel 12 Interrupt Status */
    .long  ETPU1_CIS13_IRQHandler                          /**< eTPU Engine 1 Channel 13 Interrupt Status */
    .long  ETPU1_CIS14_IRQHandler                          /**< eTPU Engine 1 Channel 14 Interrupt Status */
    .long  ETPU1_CIS15_IRQHandler                          /**< eTPU Engine 1 Channel 15 Interrupt Status */
    .long  ETPU1_CIS16_IRQHandler                          /**< eTPU Engine 1 Channel 16 Interrupt Status */
    .long  ETPU1_CIS17_IRQHandler                          /**< eTPU Engine 1 Channel 17 Interrupt Status */
    .long  ETPU1_CIS18_IRQHandler                          /**< eTPU Engine 1 Channel 18 Interrupt Status */
    .long  ETPU1_CIS19_IRQHandler                          /**< eTPU Engine 1 Channel 19 Interrupt Status */
    .long  ETPU1_CIS20_IRQHandler                          /**< eTPU Engine 1 Channel 20 Interrupt Status */
    .long  ETPU1_CIS21_IRQHandler                          /**< eTPU Engine 1 Channel 21 Interrupt Status */
    .long  ETPU1_CIS22_IRQHandler                          /**< eTPU Engine 1 Channel 22 Interrupt Status */
    .long  ETPU1_CIS23_IRQHandler                          /**< eTPU Engine 1 Channel 23 Interrupt Status */
    .long  ETPU1_CIS24_IRQHandler                          /**< eTPU Engine 1 Channel 24 Interrupt Status */
    .long  ETPU1_CIS25_IRQHandler                          /**< eTPU Engine 1 Channel 25 Interrupt Status */
    .long  ETPU1_CIS26_IRQHandler                          /**< eTPU Engine 1 Channel 26 Interrupt Status */
    .long  ETPU1_CIS27_IRQHandler                          /**< eTPU Engine 1 Channel 27 Interrupt Status */
    .long  ETPU1_CIS28_IRQHandler                          /**< eTPU Engine 1 Channel 28 Interrupt Status */
    .long  ETPU1_CIS29_IRQHandler                          /**< eTPU Engine 1 Channel 29 Interrupt Status */
    .long  ETPU1_CIS30_IRQHandler                          /**< eTPU Engine 1 Channel 30 Interrupt Status */
    .long  ETPU1_CIS31_IRQHandler                          /**< eTPU Engine 1 Channel 31 Interrupt Status */
    .long  DSPI0_FIFO_Error_IRQHandler                     /**< DSPI_0 combined overrun and parity error interrupt requests: Transmit FIFO Underflow/Receive FIFO Overflow SPI Parity Error/DSI Parity Error */
    .long  DSPI0_TXFIFO_EOQF_IRQHandler                    /**< DSPI_0 transmit FIFO End of Queue Flag */
    .long  DSPI0_Send_IRQHandler                           /**< DSPI_0 Transmit FIFO Fill Flag */
    .long  DSPI0_TCF_IRQHandler                            /**< DSPI_0 Transfer Complete/DSI Data Match Flag */
    .long  DSPI0_Receive_IRQHandler                        /**< DSPI_0 Receive FIFO Drain Flag */
    .long  CAN1_ESR1_IRQHandler                            /**< FlexCAN_1 Bus Off, Transmit Warning, Receive Warning */
    .long  CAN1_ESR2_IRQHandler                            /**< FlexCAN_1 Error, FlexCAN_1 ECC Correctable Error, FlexCAN_1 ECC Host Access Non-Correctable Error, FlexCAN_1 ECC CAN Access Non-Correctable Error */
    .long  DefaultISR                         
    .long  CAN1_BUF0_IRQHandler                            /**< FlexCAN_1 Buffer 0 Interrupt */
    .long  CAN1_BUF1_IRQHandler                            /**< FlexCAN_1 Buffer 1 Interrupt */
    .long  CAN1_BUF2_IRQHandler                            /**< FlexCAN_1 Buffer 2 Interrupt */
    .long  CAN1_BUF3_IRQHandler                            /**< FlexCAN_1 Buffer 3 Interrupt */
    .long  CAN1_BUF4_IRQHandler                            /**< FlexCAN_1 Buffer 4 Interrupt */
    .long  CAN1_BUF5_IRQHandler                            /**< FlexCAN_1 Buffer 5 Interrupt */
    .long  CAN1_BUF6_IRQHandler                            /**< FlexCAN_1 Buffer 6 Interrupt */
    .long  CAN1_BUF7_IRQHandler                            /**< FlexCAN_1 Buffer 7 Interrupt */
    .long  CAN1_BUF8_IRQHandler                            /**< FlexCAN_1 Buffer 8 Interrupt */
    .long  CAN1_BUF9_IRQHandler                            /**< FlexCAN_1 Buffer 9 Interrupt */
    .long  CAN1_BUF10_IRQHandler                           /**< FlexCAN_1 Buffer 10 Interrupt */
    .long  CAN1_BUF11_IRQHandler                           /**< FlexCAN_1 Buffer 11 Interrupt */
    .long  CAN1_BUF12_IRQHandler                           /**< FlexCAN_1 Buffer 12 Interrupt */
    .long  CAN1_BUF13_IRQHandler                           /**< FlexCAN_1 Buffer 13 Interrupt */
    .long  CAN1_BUF14_IRQHandler                           /**< FlexCAN_1 Buffer 14 Interrupt */
    .long  CAN1_BUF15_IRQHandler                           /**< FlexCAN_1 Buffer 15 Interrupt */
    .long  CAN1_BUF16_31_IRQHandler                        /**< FlexCAN_1 Buffers 31-16 Interrupts */
    .long  CAN1_BUF32_63_IRQHandler                        /**< FlexCAN_1 Buffers 63-32 Interrupts */
    .long  PIT_RTI0_IRQHandler                             /**< Periodic Interrupt Timer Interrupt 0 */
    .long  PIT_RTI1_IRQHandler                             /**< Periodic Interrupt Timer Interrupt 1 */
    .long  PIT_RTI2_IRQHandler                             /**< Periodic Interrupt Timer Interrupt 2 */
    .long  PIT_RTI3_IRQHandler                             /**< Periodic Interrupt Timer Interrupt 3 */
    .long  PIT_RTIINT_IRQHandler                           /**< Real Time Interrupt Interrupt */
    .long  DefaultISR                         
    .long  FMC_Done_IRQHandler                             /**< Flash memory program/erase complete */
    .long  CAN3_ESR1_IRQHandler                            /**< FlexCAN_3 Bus Off, Transmit Warning, Receive Warning */
    .long  CAN3_ESR2_IRQHandler                            /**< FlexCAN_3 Error, FlexCAN_3 ECC Correctable Error, FlexCAN_3 ECC Host Access Non-Correctable Error, FlexCAN_3 ECC CAN Access Non-Correctable Error */
    .long  DefaultISR                         
    .long  CAN3_BUF0_IRQHandler                            /**< FlexCAN_3 Buffer 0 Interrupt */
    .long  CAN3_BUF1_IRQHandler                            /**< FlexCAN_3 Buffer 1 Interrupt */
    .long  CAN3_BUF2_IRQHandler                            /**< FlexCAN_3 Buffer 2 Interrupt */
    .long  CAN3_BUF3_IRQHandler                            /**< FlexCAN_3 Buffer 3 Interrupt */
    .long  CAN3_BUF4_IRQHandler                            /**< FlexCAN_3 Buffer 4 Interrupt */
    .long  CAN3_BUF5_IRQHandler                            /**< FlexCAN_3 Buffer 5 Interrupt */
    .long  CAN3_BUF6_IRQHandler                            /**< FlexCAN_3 Buffer 6 Interrupt */
    .long  CAN3_BUF7_IRQHandler                            /**< FlexCAN_3 Buffer 7 Interrupt */
    .long  CAN3_BUF8_IRQHandler                            /**< FlexCAN_3 Buffer 8 Interrupt */
    .long  CAN3_BUF9_IRQHandler                            /**< FlexCAN_3 Buffer 9 Interrupt */
    .long  CAN3_BUF10_IRQHandler                           /**< FlexCAN_3 Buffer 10 Interrupt */
    .long  CAN3_BUF11_IRQHandler                           /**< FlexCAN_3 Buffer 11 Interrupt */
    .long  CAN3_BUF12_IRQHandler                           /**< FlexCAN_3 Buffer 12 Interrupt */
    .long  CAN3_BUF13_IRQHandler                           /**< FlexCAN_3 Buffer 13 Interrupt */
    .long  CAN3_BUF14_IRQHandler                           /**< FlexCAN_3 Buffer 14 Interrupt */
    .long  CAN3_BUF15_IRQHandler                           /**< FlexCAN_3 Buffer 15 Interrupt */
    .long  CAN3_BUF16_31_IRQHandler                        /**< FlexCAN_3 Buffers 31-16 Interrupts */
    .long  CAN3_BUF32_63_IRQHandler                        /**< FlexCAN_3 Buffers 63-32 Interrupts */
    .long  SRX0_GBL_STATUS_IRQHandler                      /**< SENT_0 Module Interrupts */
    .long  SRX0_CH0_IRQHandler                             /**< SENT_0_CH0 Interrupts */
    .long  SRX0_CH1_IRQHandler                             /**< SENT_0_CH1 Interrupts */
    .long  SRX0_CH2_IRQHandler                             /**< SENT_0_CH2 Interrupts */
    .long  SRX0_CH3_IRQHandler                             /**< SENT_0_CH3 Interrupts */
    .long  SRX0_CH4_IRQHandler                             /**< SENT_0_CH4 Interrupts */
    .long  SRX0_CH5_IRQHandler                             /**< SENT_0_CH5 Interrupts */
    .long  SRX1_GBL_STATUS_IRQHandler                      /**< SENT_1 Module Interrupts */
    .long  SRX1_CH0_IRQHandler                             /**< SENT_1_CH0 Interrupts */
    .long  SRX1_CH1_IRQHandler                             /**< SENT_1_CH1 Interrupts */
    .long  SRX1_CH2_IRQHandler                             /**< SENT_1_CH2 Interrupts */
    .long  SRX1_CH3_IRQHandler                             /**< SENT_1_CH3 Interrupts */
    .long  SRX1_CH4_IRQHandler                             /**< SENT_1_CH4 Interrupts */
    .long  SRX1_CH5_IRQHandler                             /**< SENT_1_CH5 Interrupts */
    .long  PMC_IRQHandler                                  /**< Power Management Controller Interrupts */
    .long  PMC_TEMP_IRQHandler                             /**< Temperature Sensor Interrupts: TEMP0_0, TEMP0_2, TEMP0_3, TEMP1_0, TEMP1_2, TEMP1_3 of PMC_ESR_TD */
    .long  JDC_IRQHandler                                  /**< JDC Interrupts: JDC_MSR[JIN_INT] | JDC_MSR[JOUT_INT] */
    .long  SIPI0_IRQHandler                                /**< SIPI Combined Interrupts: SIPI_ERR | SIPI_SR | SIPI_CSR0 */
    .long  LFAST_IRQHandler                                /**< LFAST Combined Interrupts */
    .long  MCAN_IRQHandler                                 /**< M_CAN0_0, M_CAN0_1, M_CAN1_0, M_CAN1_1 Combined Interrupts */
    .long  ERM_IRQHandler                                  /**< ERM Combined Interrupts: Single bit Correction | Multi bit Detection */
    .long  CMU01_IRQHandler                                /**< CMU_0, CMU_1 Clock Error Interrupts */
    .long  CMU23_IRQHandler                                /**< CMU_2, CMU_3 Clock Error Interrupts */
    .long  CMU45_IRQHandler                                /**< CMU_4, CMU_5 Clock Error Interrupts */
    .long  CMU67_IRQHandler                                /**< CMU_6, CMU_7 Clock Error Interrupts */
    .long  CMU8_IRQHandler                                 /**< CMU_8 Clock Error Interrupts */
    .long  CMU_RSV0_IRQHandler                             /**< CMU_RSV0 */
    .long  CMU_RSV1_IRQHandler                             /**< CMU_RSV1 */
    .long  CMU_RSV2_IRQHandler                             /**< CMU_RSV2 */
    .long  REACM_GBL_IRQHandler                            /**< Reaction Module Global Interrupt: REACM_GEFR[OVR|EF7:0] */
    .long  REACM_CH01_IRQHandler                           /**< Reaction Channel 0 and Reaction Channel 1 Combined Interrupts */
    .long  REACM_CH23_IRQHandler                           /**< Reaction Channel 2 and Reaction Channel 3 Combined Interrupts */
    .long  REACM_CH45_IRQHandler                           /**< Reaction Channel 4 and Reaction Channel 5 Combined Interrupts */
    .long  REACM_CH67_IRQHandler                           /**< Reaction Channel 6 and Reaction Channel 7 Combined Interrupts */
    .long  REACM_CH89_IRQHandler                           /**< Reaction Channel 8 and Reaction Channel 9 Combined Interrupts */
    .long  REACM_RSV0_IRQHandler                           /**< REACM_RSV0 */
    .long  REACM_RSV1_IRQHandler                           /**< REACM_RSV1 */
    .long  DEC1_IDF_IRQHandler                             /**< Decimation 1 Input (Fill) */
    .long  DEC1_OD_SD_IRQHandler                           /**< Decimation 1 Output/Integ (Drain/Integ) */
    .long  DEC1_ERR_IRQHandler                             /**< Decimation 1 Error */
    .long  ETPU2_GE_IRQHandler                             /**< eTPU Engine 2 and 1 Global Exception */
    .long  ETPU2_CIS0_IRQHandler                           /**< eTPU Engine 2 Channel 0 Interrupt Status */
    .long  ETPU2_CIS1_IRQHandler                           /**< eTPU Engine 2 Channel 1 Interrupt Status */
    .long  ETPU2_CIS2_IRQHandler                           /**< eTPU Engine 2 Channel 2 Interrupt Status */
    .long  ETPU2_CIS3_IRQHandler                           /**< eTPU Engine 2 Channel 3 Interrupt Status */
    .long  ETPU2_CIS4_IRQHandler                           /**< eTPU Engine 2 Channel 4 Interrupt Status */
    .long  ETPU2_CIS5_IRQHandler                           /**< eTPU Engine 2 Channel 5 Interrupt Status */
    .long  ETPU2_CIS6_IRQHandler                           /**< eTPU Engine 2 Channel 6 Interrupt Status */
    .long  ETPU2_CIS7_IRQHandler                           /**< eTPU Engine 2 Channel 7 Interrupt Status */
    .long  ETPU2_CIS8_IRQHandler                           /**< eTPU Engine 2 Channel 8 Interrupt Status */
    .long  ETPU2_CIS9_IRQHandler                           /**< eTPU Engine 2 Channel 9 Interrupt Status */
    .long  ETPU2_CIS10_IRQHandler                          /**< eTPU Engine 2 Channel 10 Interrupt Status */
    .long  ETPU2_CIS11_IRQHandler                          /**< eTPU Engine 2 Channel 11 Interrupt Status */
    .long  ETPU2_CIS12_IRQHandler                          /**< eTPU Engine 2 Channel 12 Interrupt Status */
    .long  ETPU2_CIS13_IRQHandler                          /**< eTPU Engine 2 Channel 13 Interrupt Status */
    .long  ETPU2_CIS14_IRQHandler                          /**< eTPU Engine 2 Channel 14 Interrupt Status */
    .long  ETPU2_CIS15_IRQHandler                          /**< eTPU Engine 2 Channel 15 Interrupt Status */
    .long  ETPU2_CIS16_IRQHandler                          /**< eTPU Engine 2 Channel 16 Interrupt Status */
    .long  ETPU2_CIS17_IRQHandler                          /**< eTPU Engine 2 Channel 17 Interrupt Status */
    .long  ETPU2_CIS18_IRQHandler                          /**< eTPU Engine 2 Channel 18 Interrupt Status */
    .long  ETPU2_CIS19_IRQHandler                          /**< eTPU Engine 2 Channel 19 Interrupt Status */
    .long  ETPU2_CIS20_IRQHandler                          /**< eTPU Engine 2 Channel 20 Interrupt Status */
    .long  ETPU2_CIS21_IRQHandler                          /**< eTPU Engine 2 Channel 21 Interrupt Status */
    .long  ETPU2_CIS22_IRQHandler                          /**< eTPU Engine 2 Channel 22 Interrupt Status */
    .long  ETPU2_CIS23_IRQHandler                          /**< eTPU Engine 2 Channel 23 Interrupt Status */
    .long  EQADC1_OVRx_IRQHandler                          /**< eQADC combined overrun interrupt requests from all of the FIFOs: Trigger Overrun, Receive FIFO Overflow and command FIFO Underflow */
    .long  EQADC1_FIFO0_NCF_IRQHandler                     /**< eQADC command FIFO 0 Non-Coherency Flag */
    .long  EQADC1_FIFO0_PF_IRQHandler                      /**< eQADC command FIFO 0 Pause Flag */
    .long  EQADC1_FIFO0_EOQF_IRQHandler                    /**< eQADC command FIFO 0 command queue End of Queue Flag */
    .long  EQADC1_FIFO0_CFFF_IRQHandler                    /**< eQADC Command FIFO 0 Fill Flag */
    .long  EQADC1_FIFO0_RFDF_IRQHandler                    /**< eQADC Receive FIFO 0 Drain Flag */
    .long  EQADC1_FIFO1_NCF_IRQHandler                     /**< eQADC command FIFO 1 Non-Coherency Flag */
    .long  EQADC1_FIFO1_PF_IRQHandler                      /**< eQADC command FIFO 1 Pause Flag */
    .long  EQADC1_FIFO1_EOQF_IRQHandler                    /**< eQADC command FIFO 1 command queue End of Queue Flag */
    .long  EQADC1_FIFO1_CFFF_IRQHandler                    /**< eQADC Command FIFO 1 Fill Flag */
    .long  EQADC1_FIFO1_RFDF_IRQHandler                    /**< eQADC Receive FIFO 1 Drain Flag */
    .long  EQADC1_FIFO2_NCF_IRQHandler                     /**< eQADC command FIFO 2 Non-Coherency Flag */
    .long  EQADC1_FIFO2_PF_IRQHandler                      /**< eQADC command FIFO 2 Pause Flag */
    .long  EQADC1_FIFO2_EOQF_IRQHandler                    /**< eQADC command FIFO 2 command queue End of Queue Flag */
    .long  EQADC1_FIFO2_CFFF_IRQHandler                    /**< eQADC Command FIFO 2 Fill Flag */
    .long  EQADC1_FIFO2_RFDF_IRQHandler                    /**< eQADC Receive FIFO 2 Drain Flag */
    .long  EQADC1_FIFO3_NCF_IRQHandler                     /**< eQADC command FIFO 3 Non-Coherency Flag */
    .long  EQADC1_FIFO3_PF_IRQHandler                      /**< eQADC command FIFO 3 Pause Flag */
    .long  EQADC1_FIFO3_EOQF_IRQHandler                    /**< eQADC command FIFO 3 command queue End of Queue Flag */
    .long  EQADC1_FIFO3_CFFF_IRQHandler                    /**< eQADC Command FIFO 3 Fill Flag */
    .long  EQADC1_FIFO3_RFDF_IRQHandler                    /**< eQADC Receive FIFO 3 Drain Flag */
    .long  EQADC1_FIFO4_NCF_IRQHandler                     /**< eQADC command FIFO 4 Non-Coherency Flag */
    .long  EQADC1_FIFO4_PF_IRQHandler                      /**< eQADC command FIFO 4 Pause Flag */
    .long  EQADC1_FIFO4_EOQF_IRQHandler                    /**< eQADC command FIFO 4 command queue End of Queue Flag */
    .long  EQADC1_FIFO4_CFFF_IRQHandler                    /**< eQADC Command FIFO 4 Fill Flag */
    .long  EQADC1_FIFO4_RFDF_IRQHandler                    /**< eQADC Receive FIFO 4 Drain Flag */
    .long  EQADC1_FIFO5_NCF_IRQHandler                     /**< eQADC command FIFO 5 Non-Coherency Flag */
    .long  EQADC1_FIFO5_PF_IRQHandler                      /**< eQADC command FIFO 5 Pause Flag */
    .long  EQADC1_FIFO5_EOQF_IRQHandler                    /**< eQADC command FIFO 5 command queue End of Queue Flag */
    .long  EQADC1_FIFO5_CFFF_IRQHandler                    /**< eQADC Command FIFO 5 Fill Flag */
    .long  EQADC1_FIFO5_RFDF_IRQHandler                    /**< eQADC Receive FIFO 5 Drain Flag */
    .long  DMA1_Ch0_Ch31_Error_IRQHandler                  /**< eDMA1 channel Error flags 0-31 */
    .long  DMA1_Ch0_IRQHandler                             /**< eDMA1 channel Interrupt 0 */
    .long  DMA1_Ch1_IRQHandler                             /**< eDMA1 channel Interrupt 1 */
    .long  DMA1_Ch2_IRQHandler                             /**< eDMA1 channel Interrupt 2 */
    .long  DMA1_Ch3_IRQHandler                             /**< eDMA1 channel Interrupt 3 */
    .long  DMA1_Ch4_IRQHandler                             /**< eDMA1 channel Interrupt 4 */
    .long  DMA1_Ch5_IRQHandler                             /**< eDMA1 channel Interrupt 5 */
    .long  DMA1_Ch6_IRQHandler                             /**< eDMA1 channel Interrupt 6 */
    .long  DMA1_Ch7_IRQHandler                             /**< eDMA1 channel Interrupt 7 */
    .long  DMA1_Ch8_IRQHandler                             /**< eDMA1 channel Interrupt 8 */
    .long  DMA1_Ch9_IRQHandler                             /**< eDMA1 channel Interrupt 9 */
    .long  DMA1_Ch10_IRQHandler                            /**< eDMA1 channel Interrupt 10 */
    .long  DMA1_Ch11_IRQHandler                            /**< eDMA1 channel Interrupt 11 */
    .long  DMA1_Ch12_IRQHandler                            /**< eDMA1 channel Interrupt 12 */
    .long  DMA1_Ch13_IRQHandler                            /**< eDMA1 channel Interrupt 13 */
    .long  DMA1_Ch14_IRQHandler                            /**< eDMA1 channel Interrupt 14 */
    .long  DMA1_Ch15_IRQHandler                            /**< eDMA1 channel Interrupt 15 */
    .long  DMA1_Ch16_IRQHandler                            /**< eDMA1 channel Interrupt 16 */
    .long  DMA1_Ch17_IRQHandler                            /**< eDMA1 channel Interrupt 17 */
    .long  DMA1_Ch18_IRQHandler                            /**< eDMA1 channel Interrupt 18 */
    .long  DMA1_Ch19_IRQHandler                            /**< eDMA1 channel Interrupt 19 */
    .long  DMA1_Ch20_IRQHandler                            /**< eDMA1 channel Interrupt 20 */
    .long  DMA1_Ch21_IRQHandler                            /**< eDMA1 channel Interrupt 21 */
    .long  DMA1_Ch22_IRQHandler                            /**< eDMA1 channel Interrupt 22 */
    .long  DMA1_Ch23_IRQHandler                            /**< eDMA1 channel Interrupt 23 */
    .long  DMA1_Ch24_IRQHandler                            /**< eDMA1 channel Interrupt 24 */
    .long  DMA1_Ch25_IRQHandler                            /**< eDMA1 channel Interrupt 25 */
    .long  DMA1_Ch26_IRQHandler                            /**< eDMA1 channel Interrupt 26 */
    .long  DMA1_Ch27_IRQHandler                            /**< eDMA1 channel Interrupt 27 */
    .long  DMA1_Ch28_IRQHandler                            /**< eDMA1 channel Interrupt 28 */
    .long  DMA1_Ch29_IRQHandler                            /**< eDMA1 channel Interrupt 29 */
    .long  DMA1_Ch30_IRQHandler                            /**< eDMA1 channel Interrupt 30 */
    .long  DMA1_Ch31_IRQHandler                            /**< eDMA1 channel Interrupt 31 */
