neelanandini/Learing_purpose/Project_Settings/Startup_Code/startup_MPC5775B.S
    def_irq_handler  ETPU2_CIS17_IRQHandler
    def_irq_handler  ETPU2_CIS18_IRQHandler
    def_irq_handler  ETPU2_CIS19_IRQHandler
    def_irq_handler  ETPU2_CIS20_IRQHandler
    def_irq_handler  ETPU2_CIS21_IRQHandler
    def_irq_handler  ETPU2_CIS22_IRQHandler
    def_irq_handler  ETPU2_CIS23_IRQHandler
    def_irq_handler  EQADC1_OVRx_IRQHandler
    def_irq_handler  EQADC1_FIFO0_NCF_IRQHandler
    def_irq_handler  EQADC1_FIFO0_PF_IRQHandler
    def_irq_handler  EQADC1_FIFO0_EOQF_IRQHandler
    def_irq_handler  EQADC1_FIFO0_CFFF_IRQHandler
    def_irq_handler  EQADC1_FIFO0_RFDF_IRQHandler
    def_irq_handler  EQADC1_FIFO1_NCF_IRQHandler
    def_irq_handler  EQADC1_FIFO1_PF_IRQHandler
    def_irq_handler  EQADC1_FIFO1_EOQF_IRQHandler
    def_irq_handler  EQADC1_FIFO1_CFFF_IRQHandler
    def_irq_handler  EQADC1_FIFO1_RFDF_IRQHandler
    def_irq_handler  EQADC1_FIFO2_NCF_IRQHandler
    def_irq_handler  EQADC1_FIFO2_PF_IRQHandler
    def_irq_handler  EQADC1_FIFO2_EOQF_IRQHandler
    def_irq_handler  EQADC1_FIFO2_CFFF_IRQHandler
    def_irq_handler  EQADC1_FIFO2_RFDF_IRQHandler
    def_irq_handler  EQADC1_FIFO3_NCF_IRQHandler
    def_irq_handler  EQADC1_FIFO3_PF_IRQHandler
    def_irq_handler  EQADC1_FIFO3_EOQF_IRQHandler
    def_irq_handler  EQADC1_FIFO3_CFFF_IRQHandler
    def_irq_handler  EQADC1_FIFO3_RFDF_IRQHandler
    def_irq_handler  EQADC1_FIFO4_NCF_IRQHandler
    def_irq_handler  EQADC1_FIFO4_PF_IRQHandler
    def_irq_handler  EQADC1_FIFO4_EOQF_IRQHandler
    def_irq_handler  EQADC1_FIFO4_CFFF_IRQHandler
    def_irq_handler  EQADC1_FIFO4_RFDF_IRQHandler
    def_irq_handler  EQADC1_FIFO5_NCF_IRQHandler
    def_irq_handler  EQADC1_FIFO5_PF_IRQHandler
    def_irq_handler  EQADC1_FIFO5_EOQF_IRQHandler
    def_irq_handler  EQADC1_FIFO5_CFFF_IRQHandler
    def_irq_handler  EQADC1_FIFO5_RFDF_IRQHandler
    def_irq_handler  DMA1_Ch0_Ch31_Error_IRQHandler
    def_irq_handler  DMA1_Ch0_IRQHandler
    def_irq_handler  DMA1_Ch1_IRQHandler
    def_irq_handler  DMA1_Ch2_IRQHandler
    def_irq_handler  DMA1_Ch3_IRQHandler
    def_irq_handler  DMA1_Ch4_IRQHandler
    def_irq_handler  DMA1_Ch5_IRQHandler
    def_irq_handler  DMA1_Ch6_IRQHandler
    def_irq_handler  DMA1_Ch7_IRQHandler
    def_irq_handler  DMA1_Ch8_IRQHandler
    def_irq_handler  DMA1_Ch9_IRQHandler
    def_irq_handler  DMA1_Ch10_IRQHandler
    def_irq_handler  DMA1_Ch11_IRQHandler
    def_irq_handler  DMA1_Ch12_IRQHandler
    def_irq_handler  DMA1_Ch13_IRQHandler
    def_irq_handler  DMA1_Ch14_IRQHandler
    def_irq_handler  DMA1_Ch15_IRQHandler
    def_irq_handler  DMA1_Ch16_IRQHandler
    def_irq_handler  DMA1_Ch17_IRQHandler
    def_irq_handler  DMA1_Ch18_IRQHandler
    def_irq_handler  DMA1_Ch19_IRQHandler
    def_irq_handler  DMA1_Ch20_IRQHandler
    def_irq_handler  DMA1_Ch21_IRQHandler
    def_irq_handler  DMA1_Ch22_IRQHandler
    def_irq_handler  DMA1_Ch23_IRQHandler
    def_irq_handler  DMA1_Ch24_IRQHandler
    def_irq_handler  DMA1_Ch25_IRQHandler
    def_irq_handler  DMA1_Ch26_IRQHandler
    def_irq_handler  DMA1_Ch27_IRQHandler
    def_irq_handler  DMA1_Ch28_IRQHandler
    def_irq_handler  DMA1_Ch29_IRQHandler
    def_irq_handler  DMA1_Ch30_IRQHandler
    def_irq_handler  DMA1_Ch31_IRQHandler
    def_irq_handler  SDADC1234_IRQHandler
    def_irq_handler  EMIOS1_CH16_IRQHandler
    def_irq_handler  EMIOS1_CH17_IRQHandler
    def_irq_handler  EMIOS1_CH18_IRQHandler
    def_irq_handler  EMIOS1_CH19_IRQHandler
    def_irq_handler  EMIOS1_CH20_IRQHandler
    def_irq_handler  EMIOS1_CH21_IRQHandler
    def_irq_handler  EMIOS1_CH22_IRQHandler
    def_irq_handler  EMIOS1_CH23_IRQHandler
    def_irq_handler  DEC2_IDF_IRQHandler
    def_irq_handler  DEC2_OD_SD_IRQHandler
    def_irq_handler  DEC2_ERR_IRQHandler
    def_irq_handler  DEC3_IDF_IRQHandler
    def_irq_handler  DEC3_OD_SD_IRQHandler
    def_irq_handler  DEC3_ERR_IRQHandler
    def_irq_handler  ESCI2_CIR_IRQHandler
    def_irq_handler  ESCI3_CIR_IRQHandler
    def_irq_handler  ESCI4_CIR_IRQHandler
    def_irq_handler  DECFILTER4_IRQHandler
    def_irq_handler  DECFILTER5_IRQHandler
    def_irq_handler  DECFILTER6_IRQHandler
    def_irq_handler  DECFILTER7_IRQHandler
    def_irq_handler  DECFILTER8_IRQHandler
    def_irq_handler  DECFILTER9_IRQHandler
    def_irq_handler  DECFILTER10_IRQHandler
    def_irq_handler  DECFILTER11_IRQHandler
    def_irq_handler  DMA1_Ch32_Ch63_Error_IRQHandler
    def_irq_handler  DMA1_Ch32_Ch39_IRQHandler
    def_irq_handler  DMA1_Ch40_Ch47_IRQHandler
    def_irq_handler  DMA1_Ch48_Ch55_IRQHandler
    def_irq_handler  DMA1_Ch56_Ch63_IRQHandler
    def_irq_handler  ETPU2_CIS24_IRQHandler
    def_irq_handler  ETPU2_CIS25_IRQHandler
    def_irq_handler  ETPU2_CIS26_IRQHandler
    def_irq_handler  ETPU2_CIS27_IRQHandler
    def_irq_handler  ETPU2_CIS28_IRQHandler
    def_irq_handler  ETPU2_CIS29_IRQHandler
    def_irq_handler  ETPU2_CIS30_IRQHandler
    def_irq_handler  ETPU2_CIS31_IRQHandler
    def_irq_handler  SWT1_IRQHandler
    def_irq_handler  SEMA4_CORE0_IRQHandler
    def_irq_handler  SEMA4_CORE1_IRQHandler
    def_irq_handler  CSE_IRQ_IRQHandler
    def_irq_handler  ESCI5_CIR_IRQHandler
    def_irq_handler  DSPI4_FIFO_Error_IRQHandler
    def_irq_handler  DSPI4_TXFIFO_EOQF_IRQHandler
    def_irq_handler  DSPI4_Send_IRQHandler
    def_irq_handler  DSPI4_TCF_IRQHandler
    def_irq_handler  DSPI4_Receive_IRQHandler
    def_irq_handler  STCU_IRQHandler
